## Creating and Loading the Retail Database

In [3]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [4]:
%env DATABASE_URL=postgresql://itv004563_retail_user:9n2upgvpgk717a28q4f5rs8hd2cblpf5@pg.itversity.com:5433/itv004563_retail_db

env: DATABASE_URL=postgresql://itv004563_retail_user:9n2upgvpgk717a28q4f5rs8hd2cblpf5@pg.itversity.com:5433/itv004563_retail_db

In [5]:
%sql SELECT current_database()

1 rows affected.

[('itv004563_retail_db',)]

In [6]:
%%sql

SELECT * FROM information_schema.tables
WHERE table_catalog = 'itv004563_retail_db'
    AND table_schema = 'public'
LIMIT 10

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
7 rows affected.

[('itv004563_retail_db', 'public', 'departments', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('itv004563_retail_db', 'public', 'categories', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('itv004563_retail_db', 'public', 'products', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('itv004563_retail_db', 'public', 'customers', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('itv004563_retail_db', 'public', 'orders', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('itv004563_retail_db', 'public', 'order_items', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('itv004563_retail_db', 'public', 'users', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None)]

In [7]:
%sql SELECT * FROM orders LIMIT 10

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
10 rows affected.

[(1, datetime.datetime(2013, 7, 25, 0, 0), 11599, 'CLOSED'),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 256, 'PENDING_PAYMENT'),
 (3, datetime.datetime(2013, 7, 25, 0, 0), 12111, 'COMPLETE'),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 8827, 'CLOSED'),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 11318, 'COMPLETE'),
 (6, datetime.datetime(2013, 7, 25, 0, 0), 7130, 'COMPLETE'),
 (7, datetime.datetime(2013, 7, 25, 0, 0), 4530, 'COMPLETE'),
 (8, datetime.datetime(2013, 7, 25, 0, 0), 2911, 'PROCESSING'),
 (9, datetime.datetime(2013, 7, 25, 0, 0), 5657, 'PENDING_PAYMENT'),
 (10, datetime.datetime(2013, 7, 25, 0, 0), 5648, 'PENDING_PAYMENT')]

In [8]:
%sql SELECT * FROM departments LIMIT 10

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
6 rows affected.

[(2, 'Fitness'),
 (3, 'Footwear'),
 (4, 'Apparel'),
 (5, 'Golf'),
 (6, 'Outdoors'),
 (7, 'Fan Shop')]

In [9]:
%sql SELECT * FROM categories LIMIT 10

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
10 rows affected.

[(1, 2, 'Football'),
 (2, 2, 'Soccer'),
 (3, 2, 'Baseball & Softball'),
 (4, 2, 'Basketball'),
 (5, 2, 'Lacrosse'),
 (6, 2, 'Tennis & Racquet'),
 (7, 2, 'Hockey'),
 (8, 2, 'More Sports'),
 (9, 3, 'Cardio Equipment'),
 (10, 3, 'Strength Training')]

In [10]:
%sql SELECT * FROM products LIMIT 10

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
10 rows affected.

[(1, 2, 'Quest Q64 10 FT. x 10 FT. Slant Leg Instant U', '', 59.98, 'http://images.acmesports.sports/Quest+Q64+10+FT.+x+10+FT.+Slant+Leg+Instant+Up+Canopy'),
 (2, 2, "Under Armour Men's Highlight MC Football Clea", '', 129.99, 'http://images.acmesports.sports/Under+Armour+Men%27s+Highlight+MC+Football+Cleat'),
 (3, 2, "Under Armour Men's Renegade D Mid Football Cl", '', 89.99, 'http://images.acmesports.sports/Under+Armour+Men%27s+Renegade+D+Mid+Football+Cleat'),
 (4, 2, "Under Armour Men's Renegade D Mid Football Cl", '', 89.99, 'http://images.acmesports.sports/Under+Armour+Men%27s+Renegade+D+Mid+Football+Cleat'),
 (5, 2, 'Riddell Youth Revolution Speed Custom Footbal', '', 199.99, 'http://images.acmesports.sports/Riddell+Youth+Revolution+Speed+Custom+Football+Helmet'),
 (6, 2, "Jordan Men's VI Retro TD Football Cleat", '', 134.99, 'http://images.acmesports.sports/Jordan+Men%27s+VI+Retro+TD+Football+Cleat'),
 (7, 2, 'Schutt Youth Recruit Hybrid Custom Football H', '', 99.99, 'http://images.acmesports.sports/Schutt+Youth+Recruit+Hybrid+Custom+Football+Helmet+2014'),
 (8, 2, "Nike Men's Vapor Carbon Elite TD Football Cle", '', 129.99, 'http://images.acmesports.sports/Nike+Men%27s+Vapor+Carbon+Elite+TD+Football+Cleat'),
 (9, 2, 'Nike Adult Vapor Jet 3.0 Receiver Gloves', '', 50.0, 'http://images.acmesports.sports/Nike+Adult+Vapor+Jet+3.0+Receiver+Gloves'),
 (10, 2, "Under Armour Men's Highlight MC Football Clea", '', 129.99, 'http://images.acmesports.sports/Under+Armour+Men%27s+Highlight+MC+Football+Cleat')]

In [11]:
%sql SELECT count(1) FROM products

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
1 rows affected.

[(1345,)]

In [12]:
%sql SELECT count(1) FROM customers

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
1 rows affected.

[(12435,)]

In [13]:
%sql SELECT count(1) FROM categories

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
1 rows affected.

[(58,)]

In [14]:
%sql SELECT count(1) FROM orders

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
1 rows affected.

[(68883,)]

## Selecting or Projecting Data

In [15]:
%sql SELECT * FROM orders LIMIT 10

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
10 rows affected.

[(1, datetime.datetime(2013, 7, 25, 0, 0), 11599, 'CLOSED'),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 256, 'PENDING_PAYMENT'),
 (3, datetime.datetime(2013, 7, 25, 0, 0), 12111, 'COMPLETE'),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 8827, 'CLOSED'),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 11318, 'COMPLETE'),
 (6, datetime.datetime(2013, 7, 25, 0, 0), 7130, 'COMPLETE'),
 (7, datetime.datetime(2013, 7, 25, 0, 0), 4530, 'COMPLETE'),
 (8, datetime.datetime(2013, 7, 25, 0, 0), 2911, 'PROCESSING'),
 (9, datetime.datetime(2013, 7, 25, 0, 0), 5657, 'PENDING_PAYMENT'),
 (10, datetime.datetime(2013, 7, 25, 0, 0), 5648, 'PENDING_PAYMENT')]

Getting column names

In [16]:
%%sql

SELECT * FROM information_schema.columns
WHERE table_catalog = 'itv004563_retail_db'
    AND table_name = 'orders'

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
4 rows affected.

[('itv004563_retail_db', 'public', 'orders', 'order_id', 1, None, 'NO', 'integer', None, None, 32, 2, 0, None, None, None, None, None, None, None, None, None, None, None, None, 'itv004563_retail_db', 'pg_catalog', 'int4', None, None, None, None, '1', 'NO', 'NO', None, None, None, None, None, 'NO', 'NEVER', None, 'YES'),
 ('itv004563_retail_db', 'public', 'orders', 'order_date', 2, None, 'NO', 'timestamp without time zone', None, None, None, None, None, 6, None, None, None, None, None, None, None, None, None, None, None, 'itv004563_retail_db', 'pg_catalog', 'timestamp', None, None, None, None, '2', 'NO', 'NO', None, None, None, None, None, 'NO', 'NEVER', None, 'YES'),
 ('itv004563_retail_db', 'public', 'orders', 'order_customer_id', 3, None, 'NO', 'integer', None, None, 32, 2, 0, None, None, None, None, None, None, None, None, None, None, None, None, 'itv004563_retail_db', 'pg_catalog', 'int4', None, None, None, None, '3', 'NO', 'NO', None, None, None, None, None, 'NO', 'NEVER', None, 'YES'),
 ('itv004563_retail_db', 'public', 'orders', 'order_status', 4, None, 'NO', 'character varying', 45, 180, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, 'itv004563_retail_db', 'pg_catalog', 'varchar', None, None, None, None, '4', 'NO', 'NO', None, None, None, None, None, 'NO', 'NEVER', None, 'YES')]

Projecting a subset of fields

In [17]:
%%sql

SELECT order_customer_id, order_date, order_status
FROM orders
LIMIT 10

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
10 rows affected.

[(11599, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED'),
 (256, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT'),
 (12111, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE'),
 (8827, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED'),
 (11318, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE'),
 (7130, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE'),
 (4530, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE'),
 (2911, datetime.datetime(2013, 7, 25, 0, 0), 'PROCESSING'),
 (5657, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT'),
 (5648, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT')]

In [18]:
%%sql

SELECT order_customer_id,
    to_char(order_date, 'yyyy-MM') AS date,
    order_status
FROM orders
LIMIT 10

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
10 rows affected.

[(11599, '2013-07', 'CLOSED'),
 (256, '2013-07', 'PENDING_PAYMENT'),
 (12111, '2013-07', 'COMPLETE'),
 (8827, '2013-07', 'CLOSED'),
 (11318, '2013-07', 'COMPLETE'),
 (7130, '2013-07', 'COMPLETE'),
 (4530, '2013-07', 'COMPLETE'),
 (2911, '2013-07', 'PROCESSING'),
 (5657, '2013-07', 'PENDING_PAYMENT'),
 (5648, '2013-07', 'PENDING_PAYMENT')]

Getting all distinct months from the table

In [19]:
%%sql

SELECT DISTINCT to_char(order_date, 'yyyy-MM') AS order_month
FROM orders

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
13 rows affected.

[('2014-01',),
 ('2014-05',),
 ('2013-12',),
 ('2013-11',),
 ('2014-04',),
 ('2014-07',),
 ('2014-03',),
 ('2013-08',),
 ('2013-10',),
 ('2013-07',),
 ('2014-02',),
 ('2013-09',),
 ('2014-06',)]

In [20]:
%%sql

SELECT count(DISTINCT to_char(order_date, 'yyyy-MM')) 
FROM orders

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
1 rows affected.

[(13,)]

## Filtering Data

We basicaly use the WHERE clause

Selecting only the orders that are complete. They have Complete as their order status

In [21]:
%%sql

SELECT * FROM orders
WHERE order_status = 'COMPLETE'
LIMIT 20

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
20 rows affected.

[(3, datetime.datetime(2013, 7, 25, 0, 0), 12111, 'COMPLETE'),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 11318, 'COMPLETE'),
 (6, datetime.datetime(2013, 7, 25, 0, 0), 7130, 'COMPLETE'),
 (7, datetime.datetime(2013, 7, 25, 0, 0), 4530, 'COMPLETE'),
 (15, datetime.datetime(2013, 7, 25, 0, 0), 2568, 'COMPLETE'),
 (17, datetime.datetime(2013, 7, 25, 0, 0), 2667, 'COMPLETE'),
 (22, datetime.datetime(2013, 7, 25, 0, 0), 333, 'COMPLETE'),
 (26, datetime.datetime(2013, 7, 25, 0, 0), 7562, 'COMPLETE'),
 (28, datetime.datetime(2013, 7, 25, 0, 0), 656, 'COMPLETE'),
 (32, datetime.datetime(2013, 7, 25, 0, 0), 3960, 'COMPLETE'),
 (35, datetime.datetime(2013, 7, 25, 0, 0), 4840, 'COMPLETE'),
 (45, datetime.datetime(2013, 7, 25, 0, 0), 2636, 'COMPLETE'),
 (56, datetime.datetime(2013, 7, 25, 0, 0), 10519, 'COMPLETE'),
 (63, datetime.datetime(2013, 7, 25, 0, 0), 1148, 'COMPLETE'),
 (65, datetime.datetime(2013, 7, 25, 0, 0), 5903, 'COMPLETE'),
 (67, datetime.datetime(2013, 7, 25, 0, 0), 1406, 'COMPLETE'),
 (71, datetime.datetime(2013, 7, 25, 0, 0), 8646, 'COMPLETE'),
 (72, datetime.datetime(2013, 7, 25, 0, 0), 4349, 'COMPLETE'),
 (76, datetime.datetime(2013, 7, 25, 0, 0), 6898, 'COMPLETE'),
 (80, datetime.datetime(2013, 7, 25, 0, 0), 3007, 'COMPLETE')]

In [22]:
%%sql 

SELECT count(1)
FROM orders 
WHERE order_status = 'COMPLETE'

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
1 rows affected.

[(22899,)]

We have 22899 complete orders

In [23]:
%%sql
SELECT DISTINCT order_status
FROM orders

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
9 rows affected.

[('COMPLETE',),
 ('ON_HOLD',),
 ('PENDING_PAYMENT',),
 ('PENDING',),
 ('CLOSED',),
 ('CANCELED',),
 ('PROCESSING',),
 ('PAYMENT_REVIEW',),
 ('SUSPECTED_FRAUD',)]

In [24]:
%%sql 

SELECT * FROM orders
WHERE order_status IN ('COMPLETE', 'CLOSED', 'PROCESSING', 'PAYMENT_REVIEW')
LIMIT 20

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
20 rows affected.

[(1, datetime.datetime(2013, 7, 25, 0, 0), 11599, 'CLOSED'),
 (3, datetime.datetime(2013, 7, 25, 0, 0), 12111, 'COMPLETE'),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 8827, 'CLOSED'),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 11318, 'COMPLETE'),
 (6, datetime.datetime(2013, 7, 25, 0, 0), 7130, 'COMPLETE'),
 (7, datetime.datetime(2013, 7, 25, 0, 0), 4530, 'COMPLETE'),
 (8, datetime.datetime(2013, 7, 25, 0, 0), 2911, 'PROCESSING'),
 (11, datetime.datetime(2013, 7, 25, 0, 0), 918, 'PAYMENT_REVIEW'),
 (12, datetime.datetime(2013, 7, 25, 0, 0), 1837, 'CLOSED'),
 (14, datetime.datetime(2013, 7, 25, 0, 0), 9842, 'PROCESSING'),
 (15, datetime.datetime(2013, 7, 25, 0, 0), 2568, 'COMPLETE'),
 (17, datetime.datetime(2013, 7, 25, 0, 0), 2667, 'COMPLETE'),
 (18, datetime.datetime(2013, 7, 25, 0, 0), 1205, 'CLOSED'),
 (20, datetime.datetime(2013, 7, 25, 0, 0), 9198, 'PROCESSING'),
 (22, datetime.datetime(2013, 7, 25, 0, 0), 333, 'COMPLETE'),
 (24, datetime.datetime(2013, 7, 25, 0, 0), 11441, 'CLOSED'),
 (25, datetime.datetime(2013, 7, 25, 0, 0), 9503, 'CLOSED'),
 (26, datetime.datetime(2013, 7, 25, 0, 0), 7562, 'COMPLETE'),
 (28, datetime.datetime(2013, 7, 25, 0, 0), 656, 'COMPLETE'),
 (29, datetime.datetime(2013, 7, 25, 0, 0), 196, 'PROCESSING')]

How many of the orders have been sold?

In [25]:
%%sql 

SELECT count(1) FROM orders
WHERE order_status IN ('COMPLETE', 'CLOSED', 'PROCESSING', 'PAYMENT_REVIEW')

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
1 rows affected.

[(39459,)]

39459 orders have been sold

In [26]:
%%sql

SELECT * FROM  orders
WHERE order_status = 'COMPLETE' OR  order_status = 'CLOSED'
LIMIT 10

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
10 rows affected.

[(1, datetime.datetime(2013, 7, 25, 0, 0), 11599, 'CLOSED'),
 (3, datetime.datetime(2013, 7, 25, 0, 0), 12111, 'COMPLETE'),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 8827, 'CLOSED'),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 11318, 'COMPLETE'),
 (6, datetime.datetime(2013, 7, 25, 0, 0), 7130, 'COMPLETE'),
 (7, datetime.datetime(2013, 7, 25, 0, 0), 4530, 'COMPLETE'),
 (12, datetime.datetime(2013, 7, 25, 0, 0), 1837, 'CLOSED'),
 (15, datetime.datetime(2013, 7, 25, 0, 0), 2568, 'COMPLETE'),
 (17, datetime.datetime(2013, 7, 25, 0, 0), 2667, 'COMPLETE'),
 (18, datetime.datetime(2013, 7, 25, 0, 0), 1205, 'CLOSED')]

In [27]:
%%sql

SELECT * FROM orders
WHERE order_status IN ('COMPLETE', 'CLOSED')
LIMIT 10

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
10 rows affected.

[(1, datetime.datetime(2013, 7, 25, 0, 0), 11599, 'CLOSED'),
 (3, datetime.datetime(2013, 7, 25, 0, 0), 12111, 'COMPLETE'),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 8827, 'CLOSED'),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 11318, 'COMPLETE'),
 (6, datetime.datetime(2013, 7, 25, 0, 0), 7130, 'COMPLETE'),
 (7, datetime.datetime(2013, 7, 25, 0, 0), 4530, 'COMPLETE'),
 (12, datetime.datetime(2013, 7, 25, 0, 0), 1837, 'CLOSED'),
 (15, datetime.datetime(2013, 7, 25, 0, 0), 2568, 'COMPLETE'),
 (17, datetime.datetime(2013, 7, 25, 0, 0), 2667, 'COMPLETE'),
 (18, datetime.datetime(2013, 7, 25, 0, 0), 1205, 'CLOSED')]

In [28]:
%%sql

SELECT * FROM orders
WHERE order_status IN ('CANCELED', 'PENDING')
    AND to_char(order_date, 'yyyy-MM') LIKE '2014-01%'
LIMIT 20

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
20 rows affected.

[(25878, datetime.datetime(2014, 1, 1, 0, 0), 9084, 'PENDING'),
 (25879, datetime.datetime(2014, 1, 1, 0, 0), 5118, 'PENDING'),
 (25880, datetime.datetime(2014, 1, 1, 0, 0), 10146, 'CANCELED'),
 (25883, datetime.datetime(2014, 1, 1, 0, 0), 11764, 'PENDING'),
 (25885, datetime.datetime(2014, 1, 1, 0, 0), 7253, 'PENDING'),
 (25887, datetime.datetime(2014, 1, 1, 0, 0), 10062, 'PENDING'),
 (25890, datetime.datetime(2014, 1, 1, 0, 0), 2581, 'PENDING'),
 (25908, datetime.datetime(2014, 1, 1, 0, 0), 11055, 'PENDING'),
 (25912, datetime.datetime(2014, 1, 1, 0, 0), 3537, 'CANCELED'),
 (25929, datetime.datetime(2014, 1, 1, 0, 0), 2098, 'PENDING'),
 (25957, datetime.datetime(2014, 1, 1, 0, 0), 11268, 'PENDING'),
 (25977, datetime.datetime(2014, 1, 1, 0, 0), 9030, 'PENDING'),
 (25979, datetime.datetime(2014, 1, 1, 0, 0), 8216, 'PENDING'),
 (25989, datetime.datetime(2014, 1, 2, 0, 0), 2656, 'PENDING'),
 (26002, datetime.datetime(2014, 1, 2, 0, 0), 3494, 'PENDING'),
 (26007, datetime.datetime(2014, 1, 2, 0, 0), 6903, 'PENDING'),
 (26012, datetime.datetime(2014, 1, 2, 0, 0), 8927, 'PENDING'),
 (26015, datetime.datetime(2014, 1, 2, 0, 0), 5321, 'PENDING'),
 (26024, datetime.datetime(2014, 1, 2, 0, 0), 291, 'PENDING'),
 (26027, datetime.datetime(2014, 1, 2, 0, 0), 11861, 'PENDING')]

In [29]:
%%sql

SELECT count(1), min(order_date), max(order_date), count(DISTINCT order_date)
FROM orders
WHERE order_status IN ('COMPLETE', 'CLOSED')
    AND order_date BETWEEN '2014-01-01' AND '2014-02-11'

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
1 rows affected.

[(3512, datetime.datetime(2014, 1, 1, 0, 0), datetime.datetime(2014, 2, 11, 0, 0), 42)]

In [30]:
%%sql 

DROP TABLE IF EXISTS users

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
Done.

[]

In [31]:
%%sql

CREATE TABLE users (
    user_id SERIAL PRIMARY KEY,
    user_first_name VARCHAR(30) NOT NULL,
    user_last_name VARCHAR(30) NOT NULL,
    user_email_id VARCHAR(50) NOT NULL,
    user_email_validated BOOLEAN DEFAULT FALSE,
    user_password VARCHAR(200),
    user_role VARCHAR(1) NOT NULL DEFAULT 'U', --U and A
    is_active BOOLEAN DEFAULT FALSE,
    create_ts TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    last_updated_ts TIMESTAMP DEFAULT CURRENT_TIMESTAMP
);

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
Done.

[]

In [32]:
%%sql

INSERT INTO users 
    (user_first_name, user_last_name, user_email_id, user_password, user_role, is_active) 
VALUES 
    ('Gordan', 'Bradock', 'gbradock0@barnesandnoble.com', 'h9LAz7p7ub', 'U', true),
    ('Tobe', 'Lyness', 'tlyness1@paginegialle.it', 'oEofndp', 'U', true),
    ('Addie', 'Mesias', 'amesias2@twitpic.com', 'ih7Y69u56', 'U', true)

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
3 rows affected.

[]

In [33]:
%%sql

INSERT INTO users (user_first_name, user_last_name, user_email_id)
VALUES ('Donald', 'Duck', 'donald@duck.com')

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
1 rows affected.

[]

In [34]:
%%sql

INSERT INTO users (user_first_name, user_last_name, user_email_id, user_role, is_active)
VALUES ('Mickey', 'Mouse', 'mickey@mouse.com', 'U', true)

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
1 rows affected.

[]

In [35]:
%%sql
SELECT * FROM users

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
5 rows affected.

[(1, 'Gordan', 'Bradock', 'gbradock0@barnesandnoble.com', False, 'h9LAz7p7ub', 'U', True, datetime.datetime(2022, 11, 10, 8, 29, 3, 176088), datetime.datetime(2022, 11, 10, 8, 29, 3, 176088)),
 (2, 'Tobe', 'Lyness', 'tlyness1@paginegialle.it', False, 'oEofndp', 'U', True, datetime.datetime(2022, 11, 10, 8, 29, 3, 176088), datetime.datetime(2022, 11, 10, 8, 29, 3, 176088)),
 (3, 'Addie', 'Mesias', 'amesias2@twitpic.com', False, 'ih7Y69u56', 'U', True, datetime.datetime(2022, 11, 10, 8, 29, 3, 176088), datetime.datetime(2022, 11, 10, 8, 29, 3, 176088)),
 (4, 'Donald', 'Duck', 'donald@duck.com', False, None, 'U', False, datetime.datetime(2022, 11, 10, 8, 29, 3, 245409), datetime.datetime(2022, 11, 10, 8, 29, 3, 245409)),
 (5, 'Mickey', 'Mouse', 'mickey@mouse.com', False, None, 'U', True, datetime.datetime(2022, 11, 10, 8, 29, 3, 320077), datetime.datetime(2022, 11, 10, 8, 29, 3, 320077))]

Getting the null values

In [36]:
%%sql

SELECT * FROM users
WHERE user_password IS NULL

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
2 rows affected.

[(4, 'Donald', 'Duck', 'donald@duck.com', False, None, 'U', False, datetime.datetime(2022, 11, 10, 8, 29, 3, 245409), datetime.datetime(2022, 11, 10, 8, 29, 3, 245409)),
 (5, 'Mickey', 'Mouse', 'mickey@mouse.com', False, None, 'U', True, datetime.datetime(2022, 11, 10, 8, 29, 3, 320077), datetime.datetime(2022, 11, 10, 8, 29, 3, 320077))]

## Joining tables inner

In [37]:
%%sql

SELECT * FROM information_schema.tables
WHERE table_catalog = 'itv004563_retail_db'
    AND table_schema = 'public'
LIMIT 10

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
7 rows affected.

[('itv004563_retail_db', 'public', 'departments', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('itv004563_retail_db', 'public', 'categories', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('itv004563_retail_db', 'public', 'products', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('itv004563_retail_db', 'public', 'customers', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('itv004563_retail_db', 'public', 'orders', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('itv004563_retail_db', 'public', 'order_items', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('itv004563_retail_db', 'public', 'users', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None)]

Joining some variables of order_id and order

In [38]:
%%sql

SELECT o.order_id,
    o.order_date,
    o.order_status,
    oi.order_item_subtotal
FROM orders o JOIN order_items oi
    ON o.order_id = oi.order_item_order_id
LIMIT 10

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
10 rows affected.

[(1, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 299.98),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT', 199.99),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT', 250.0),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT', 129.99),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 49.98),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 299.95),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 150.0),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 199.92),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', 299.98),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', 299.95)]

In [39]:
%sql SELECT count(1) FROM order_items

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
1 rows affected.

[(172198,)]

In [40]:
%%sql

SELECT count(1)
FROM orders o JOIN order_items oi
    ON o.order_id = oi.order_item_order_id
WHERE o.order_status IN ('COMPLETE', 'CLOSED')

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
1 rows affected.

[(75408,)]

In [41]:
%%sql

SELECT o.order_id,
    o.order_date,
    o.order_status,
    oi.order_item_subtotal
FROM orders o JOIN order_items oi
    ON o.order_id = oi.order_item_order_id
WHERE o.order_status IN ('COMPLETE', 'CLOSED')
    AND to_char(order_date, 'yyyy-MM') = '2014-01'
LIMIT 10

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
10 rows affected.

[(25882, datetime.datetime(2014, 1, 1, 0, 0), 'COMPLETE', 299.97),
 (25882, datetime.datetime(2014, 1, 1, 0, 0), 'COMPLETE', 100.0),
 (25882, datetime.datetime(2014, 1, 1, 0, 0), 'COMPLETE', 79.98),
 (25882, datetime.datetime(2014, 1, 1, 0, 0), 'COMPLETE', 399.98),
 (25888, datetime.datetime(2014, 1, 1, 0, 0), 'COMPLETE', 299.98),
 (25889, datetime.datetime(2014, 1, 1, 0, 0), 'COMPLETE', 99.96),
 (25889, datetime.datetime(2014, 1, 1, 0, 0), 'COMPLETE', 19.99),
 (25891, datetime.datetime(2014, 1, 1, 0, 0), 'CLOSED', 150.0),
 (25891, datetime.datetime(2014, 1, 1, 0, 0), 'CLOSED', 50.0),
 (25891, datetime.datetime(2014, 1, 1, 0, 0), 'CLOSED', 119.97)]

## Joining Tables - Outer

In [42]:
%%sql

SELECT o.order_id,
    o.order_date,
    o.order_status,
    oi.order_item_order_id,
    oi.order_item_subtotal
FROM orders o LEFT OUTER JOIN order_items oi
    ON o.order_id = oi.order_item_order_id
ORDER BY o.order_id
LIMIT 14

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
14 rows affected.

[(1, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 1, 299.98),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT', 2, 129.99),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT', 2, 199.99),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT', 2, 250.0),
 (3, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', None, None),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 4, 199.92),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 4, 299.95),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 4, 49.98),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 4, 150.0),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', 5, 299.98),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', 5, 129.99),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', 5, 299.95),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', 5, 99.96),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', 5, 299.98)]

In [43]:
%%sql

SELECT count(1)
FROM orders o LEFT OUTER JOIN order_items oi
    ON o.order_id = oi.order_item_order_id

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
1 rows affected.

[(183650,)]

Getting records that are in orders but not order items

In [44]:
%%sql

SELECT o.order_id,
    o.order_date,
    o.order_status,
    oi.order_item_order_id,
    oi.order_item_subtotal
FROM orders o LEFT OUTER JOIN order_items oi
    ON o.order_id = oi.order_item_order_id
WHERE oi.order_item_order_id IS NULL
ORDER BY o.order_id
LIMIT 10

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
10 rows affected.

[(3, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', None, None),
 (6, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', None, None),
 (22, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', None, None),
 (26, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', None, None),
 (32, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', None, None),
 (40, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT', None, None),
 (47, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT', None, None),
 (53, datetime.datetime(2013, 7, 25, 0, 0), 'PROCESSING', None, None),
 (54, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT', None, None),
 (55, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING', None, None)]

In [45]:
%%sql

SELECT count(1)
FROM orders o LEFT OUTER JOIN order_items oi
    ON o.order_id = oi.order_item_order_id
WHERE oi.order_item_order_id IS NULL
    AND O.ORDER_STATUS IN ('COMPLETE', 'CLOSED')

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
1 rows affected.

[(5189,)]

In [46]:
%%sql

SELECT o.order_id,
    o.order_date,
    o.order_status,
    oi.order_item_order_id,
    oi.order_item_subtotal
FROM orders o RIGHT OUTER JOIN order_items oi
    ON o.order_id = oi.order_item_order_id

ORDER BY o.order_id
LIMIT 10

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
10 rows affected.

[(1, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 1, 299.98),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT', 2, 129.99),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT', 2, 250.0),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT', 2, 199.99),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 4, 150.0),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 4, 199.92),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 4, 299.95),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 4, 49.98),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', 5, 299.98),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', 5, 299.95)]

In [47]:
%%sql

SELECT count(1)
FROM orders o RIGHT OUTER JOIN order_items oi
    ON o.order_id = oi.order_item_order_id
WHERE o.ORDER_STATUS IN ('COMPLETE', 'CLOSED')

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
1 rows affected.

[(75408,)]

## Performing Aggregations

Getting the number of unique order_ids from our database

In [48]:
%sql SELECT count(DISTINCT order_id) FROM orders

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
1 rows affected.

[(68883,)]

In [49]:
%sql SELECT count(DISTINCT order_date)  FROM orders

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
1 rows affected.

[(364,)]

performing global aggregation

In [50]:
%%sql

SELECT * FROM order_items
WHERE order_item_order_id = 2

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
3 rows affected.

[(2, 2, 1073, 1, 199.99, 199.99),
 (3, 2, 502, 5, 250.0, 50.0),
 (4, 2, 403, 1, 129.99, 129.99)]

In [51]:
%%sql

SELECT round(sum(order_item_subtotal::numeric), 3) AS order_revenue
FROM order_items
WHERE order_item_order_id = 2

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
1 rows affected.

[(Decimal('579.980'),)]

Aggregation by key

In [56]:
%%sql

SELECT order_date, 
    count(1) 
FROM orders
GROUP BY order_date
ORDER BY count(1)
LIMIT 10

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
10 rows affected.

[(datetime.datetime(2013, 8, 13, 0, 0), 73),
 (datetime.datetime(2014, 5, 27, 0, 0), 85),
 (datetime.datetime(2014, 3, 17, 0, 0), 91),
 (datetime.datetime(2014, 6, 21, 0, 0), 92),
 (datetime.datetime(2013, 8, 19, 0, 0), 93),
 (datetime.datetime(2014, 3, 29, 0, 0), 96),
 (datetime.datetime(2013, 9, 4, 0, 0), 96),
 (datetime.datetime(2014, 5, 19, 0, 0), 97),
 (datetime.datetime(2013, 12, 2, 0, 0), 99),
 (datetime.datetime(2014, 5, 8, 0, 0), 99)]

In [58]:
%%sql

SELECT order_item_order_id,
    round(sum(order_item_subtotal)::numeric, 2) AS order_revenue
FROM order_items GROUP BY order_item_order_id
LIMIT 10

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
10 rows affected.

[(1, Decimal('299.98')),
 (2, Decimal('579.98')),
 (4, Decimal('699.85')),
 (5, Decimal('1129.86')),
 (7, Decimal('579.92')),
 (8, Decimal('729.84')),
 (9, Decimal('599.96')),
 (10, Decimal('651.92')),
 (11, Decimal('919.79')),
 (12, Decimal('1299.87'))]

In [77]:
%%sql

SELECT o.order_date,
    oi.order_item_product_id,
    round(sum(oi.order_item_subtotal::numeric), 2) AS revenue
FROM orders o JOIN order_items oi
    ON o.order_id = oi.order_item_product_id
WHERE o.order_status IN ('COMPLETE', 'CLOSED')
GROUP BY o.order_date,
    oi.order_item_product_id
HAVING round(sum(oi.order_item_subtotal::numeric), 2) >= 500
ORDER BY o.order_date, revenue DESC
LIMIT 10

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
10 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), 37, Decimal('27327.19')),
 (datetime.datetime(2013, 7, 25, 0, 0), 24, Decimal('18477.69')),
 (datetime.datetime(2013, 7, 25, 0, 0), 35, Decimal('10399.35')),
 (datetime.datetime(2013, 7, 25, 0, 0), 61, Decimal('8399.72')),
 (datetime.datetime(2013, 7, 26, 0, 0), 191, Decimal('3667633.20')),
 (datetime.datetime(2013, 7, 26, 0, 0), 249, Decimal('46559.59')),
 (datetime.datetime(2013, 7, 26, 0, 0), 116, Decimal('44585.09')),
 (datetime.datetime(2013, 7, 26, 0, 0), 172, Decimal('27210.00')),
 (datetime.datetime(2013, 7, 26, 0, 0), 258, Decimal('19567.94')),
 (datetime.datetime(2013, 7, 26, 0, 0), 135, Decimal('19426.00'))]

## Sorting Data

In [83]:
%%sql

SELECT * FROM orders
ORDER BY order_customer_id 
LIMIT 10

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
10 rows affected.

[(22945, datetime.datetime(2013, 12, 13, 0, 0), 1, 'COMPLETE'),
 (33865, datetime.datetime(2014, 2, 18, 0, 0), 2, 'COMPLETE'),
 (67863, datetime.datetime(2013, 11, 30, 0, 0), 2, 'COMPLETE'),
 (15192, datetime.datetime(2013, 10, 29, 0, 0), 2, 'PENDING_PAYMENT'),
 (57963, datetime.datetime(2013, 8, 2, 0, 0), 2, 'ON_HOLD'),
 (56178, datetime.datetime(2014, 7, 15, 0, 0), 3, 'PENDING'),
 (57617, datetime.datetime(2014, 7, 24, 0, 0), 3, 'COMPLETE'),
 (23662, datetime.datetime(2013, 12, 19, 0, 0), 3, 'COMPLETE'),
 (22646, datetime.datetime(2013, 12, 11, 0, 0), 3, 'COMPLETE'),
 (35158, datetime.datetime(2014, 2, 26, 0, 0), 3, 'COMPLETE')]

In [90]:
%%sql

SELECT o.order_date,
    oi.order_item_product_id,
    round(sum(oi.order_item_subtotal::numeric), 2) AS revenue
FROM orders o JOIN order_items oi
    ON o.order_id = oi.order_item_product_id
WHERE o.order_status IN ('COMPLETE', 'CLOSED')
GROUP BY o.order_date, 
    oi.order_item_product_id
HAVING round(sum(oi.order_item_subtotal::numeric), 2) >= 1000
ORDER BY o.order_date,
    revenue DESC
LIMIT 10

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
10 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), 37, Decimal('27327.19')),
 (datetime.datetime(2013, 7, 25, 0, 0), 24, Decimal('18477.69')),
 (datetime.datetime(2013, 7, 25, 0, 0), 35, Decimal('10399.35')),
 (datetime.datetime(2013, 7, 25, 0, 0), 61, Decimal('8399.72')),
 (datetime.datetime(2013, 7, 26, 0, 0), 191, Decimal('3667633.20')),
 (datetime.datetime(2013, 7, 26, 0, 0), 249, Decimal('46559.59')),
 (datetime.datetime(2013, 7, 26, 0, 0), 116, Decimal('44585.09')),
 (datetime.datetime(2013, 7, 26, 0, 0), 172, Decimal('27210.00')),
 (datetime.datetime(2013, 7, 26, 0, 0), 258, Decimal('19567.94')),
 (datetime.datetime(2013, 7, 26, 0, 0), 135, Decimal('19426.00'))]

## EXERCISES

### Excercise 1 - Customer Order Count

Get order count per customer for the month of 2014 January.

    Tables - orders and customers
    Data should be sorted in descending order by count and ascending order by customer id.
    Output should contain customer_id, customer_first_name, customer_last_name and customer_order_count

In [92]:
%%sql

SELECT count(1) 
FROM orders
WHERE to_char(order_date, 'yyyy-MM') LIKE '2014-01%'

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
1 rows affected.

[(5908,)]

In [105]:
%%sql

SELECT * FROM customers
LIMIT 4

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
4 rows affected.

[(1, 'Richard', 'Hernandez', 'XXXXXXXXX', 'XXXXXXXXX', '6303 Heather Plaza', 'Brownsville', 'TX', '78521'),
 (2, 'Mary', 'Barrett', 'XXXXXXXXX', 'XXXXXXXXX', '9526 Noble Embers Ridge', 'Littleton', 'CO', '80126'),
 (3, 'Ann', 'Smith', 'XXXXXXXXX', 'XXXXXXXXX', '3422 Blue Pioneer Bend', 'Caguas', 'PR', '00725'),
 (4, 'Mary', 'Jones', 'XXXXXXXXX', 'XXXXXXXXX', '8324 Little Common', 'San Marcos', 'CA', '92069')]

There were 5908 customers in January 2014

In [120]:
%%sql

SELECT customer_id,
    customer_fname, 
    customer_lname,
    count(1) AS customer_order_count
FROM customers
GROUP BY customer_id
LIMIT 10

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
10 rows affected.

[(1, 'Richard', 'Hernandez', 1),
 (2, 'Mary', 'Barrett', 1),
 (3, 'Ann', 'Smith', 1),
 (4, 'Mary', 'Jones', 1),
 (5, 'Robert', 'Hudson', 1),
 (6, 'Mary', 'Smith', 1),
 (7, 'Melissa', 'Wilcox', 1),
 (8, 'Megan', 'Smith', 1),
 (9, 'Mary', 'Perez', 1),
 (10, 'Melissa', 'Smith', 1)]

### Excercise 2- Dormant Customers

Get the customer details who have not placed any order for the month of 2014 January.

    Tables - orders and customers
    Data should be sorted in ascending order by customer_id
    Output should contain all the fields from customers

In [122]:
%%sql

SELECT count(1)
FROM orders o RIGHT OUTER JOIN order_items oi
    ON o.order_id = oi.order_item_order_id
WHERE o.ORDER_STATUS IN ('COMPLETE', 'CLOSED')

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
1 rows affected.

[(75408,)]

In [125]:
%%sql

SELECT DISTINCT(order_status) FROM orders

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
9 rows affected.

[('COMPLETE',),
 ('ON_HOLD',),
 ('PENDING_PAYMENT',),
 ('PENDING',),
 ('CLOSED',),
 ('CANCELED',),
 ('PROCESSING',),
 ('PAYMENT_REVIEW',),
 ('SUSPECTED_FRAUD',)]

In [133]:
%%sql

SELECT * FROM customers
LIMIT 2

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
2 rows affected.

[(1, 'Richard', 'Hernandez', 'XXXXXXXXX', 'XXXXXXXXX', '6303 Heather Plaza', 'Brownsville', 'TX', '78521'),
 (2, 'Mary', 'Barrett', 'XXXXXXXXX', 'XXXXXXXXX', '9526 Noble Embers Ridge', 'Littleton', 'CO', '80126')]

In [136]:
%%sql

SELECT o.order_date, 
    o.order_status,
    c.customer_id,
    c.customer_fname,
    c.customer_lname,
    c.customer_email,
    c.customer_street, 
    c.customer_city,
    c.customer_state,
    c.customer_zipcode
FROM orders o
    JOIN customers c
        ON o.order_customer_id = c.customer_id
WHERE o.order_status IN ('CANCELED', 'SUSPECTED_FRAUD','ON_HOLD')
    AND to_char(order_date, 'yyyy-MM') LIKE '2014-01%'
LIMIT 5

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
5 rows affected.

[(datetime.datetime(2014, 1, 1, 0, 0), 'CANCELED', 10146, 'Andrew', 'Smith', 'XXXXXXXXX', '7116 Cotton Log Cape', 'Anaheim', 'CA', '92802'),
 (datetime.datetime(2014, 1, 1, 0, 0), 'ON_HOLD', 3853, 'Eugene', 'Smith', 'XXXXXXXXX', '5311 Honey Parkway', 'South Richmond Hill', 'NY', '11419'),
 (datetime.datetime(2014, 1, 1, 0, 0), 'CANCELED', 3537, 'Ralph', 'Smith', 'XXXXXXXXX', '7011 Cozy Beach', 'La Mesa', 'CA', '91941'),
 (datetime.datetime(2014, 1, 1, 0, 0), 'ON_HOLD', 1708, 'Margaret', 'Booth', 'XXXXXXXXX', '8990 Rocky Lake Freeway', 'Arlington', 'TX', '76010'),
 (datetime.datetime(2014, 1, 1, 0, 0), 'ON_HOLD', 8376, 'Catherine', 'Moreno', 'XXXXXXXXX', '3857 Bright Gate Gate', 'Silver Spring', 'MD', '20904')]

### Exercise 3 - Revenue Per Customer

Get the revenue generated by each customer for the month of 2014 January

    Tables - orders, order_items and customers
    Data should be sorted in descending order by revenue and then ascending order by customer_id
    Output should contain customer_id, customer_first_name, customer_last_name, customer_revenue.
    If there are no orders placed by customer, then the corresponding revenue for a give customer should be 0.
    Consider only COMPLETE and CLOSED orders

In [138]:
%%sql

SELECT * FROM customers
LIMIT 2

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
2 rows affected.

[(1, 'Richard', 'Hernandez', 'XXXXXXXXX', 'XXXXXXXXX', '6303 Heather Plaza', 'Brownsville', 'TX', '78521'),
 (2, 'Mary', 'Barrett', 'XXXXXXXXX', 'XXXXXXXXX', '9526 Noble Embers Ridge', 'Littleton', 'CO', '80126')]

In [139]:
%%sql

SELECT * FROM orders
LIMIT 2

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
2 rows affected.

[(1, datetime.datetime(2013, 7, 25, 0, 0), 11599, 'CLOSED'),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 256, 'PENDING_PAYMENT')]

In [150]:
%%sql

SELECT * FROM order_items
LIMIT 2

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
2 rows affected.

[(1, 1, 957, 1, 299.98, 299.98), (2, 2, 1073, 1, 199.99, 199.99)]

In [155]:
%%sql

SELECT c.customer_id,
    c.customer_fname,
    c.customer_lname,
    sum(oi.order_item_subtotal) AS customer_revenue

FROM orders o
    JOIN customers c
        ON o.order_customer_id = c.customer_id
    JOIN order_items oi
        ON oi.order_item_id = o.order_id
WHERE order_status IN ('COMPLETE', 'CLOSED')
    AND to_char(order_date, 'yyyy-MM') LIKE '2014-01%'
GROUP BY o.order_date,c.customer_id
ORDER BY customer_revenue DESC, customer_id
LIMIT 10

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
10 rows affected.

[(439, 'Rose', 'Delgado', 799.96),
 (8950, 'David', 'Smith', 699.96),
 (4234, 'Dorothy', 'Spencer', 599.96),
 (1054, 'Barbara', 'Cooley', 579.95),
 (333, 'Elizabeth', 'Ferguson', 549.98),
 (640, 'Jean', 'Smith', 529.97),
 (27, 'Mary', 'Vincent', 499.95),
 (646, 'Tammy', 'Smith', 499.95),
 (1234, 'Steven', 'Bond', 499.95),
 (1627, 'Mary', 'Gonzales', 499.95)]

### Exercise 4 - Revenue Per Category

Get the revenue generated for each category for the month of 2014 January

    Tables - orders, order_items, products and categories
    Data should be sorted in ascending order by category_id.
    Output should contain all the fields from category along with the revenue as category_revenue.
    Consider only COMPLETE and CLOSED orders

### Exercise 5 - Product Count Per Department

Get the products for each department.

    Tables - departments, categories, products
    Data should be sorted in ascending order by department_id
    Output should contain all the fields from department and the product count as product_count

In [168]:
%sql DROP TABLE IF EXISTS users

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
Done.

[]

In [169]:
%%sql

CREATE TABLE users (
    user_id INT,
    user_first_name VARCHAR(30) NOT NULL,
    user_last_name VARCHAR(30) NOT NULL,
    user_email_id VARCHAR(50) NOT NULL,
    user_email_validated BOOLEAN DEFAULT FALSE,
    user_password VARCHAR(200),
    user_role VARCHAR(1) NOT NULL DEFAULT 'U', --U and A
    is_active BOOLEAN DEFAULT FALSE,
    created_dt DATE DEFAULT CURRENT_DATE,
    last_updated_ts TIMESTAMP DEFAULT CURRENT_TIMESTAMP
)

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
Done.

[]

In [170]:
%%sql 

SELECT table_catalog, 
    table_name,
    column_name,
    data_type,
    character_maximum_length,
    column_default,
    is_nullable,
    ordinal_position
FROM information_schema.columns 
WHERE table_name = 'users'
ORDER BY ordinal_position

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
10 rows affected.

[('itv004563_retail_db', 'users', 'user_id', 'integer', None, None, 'YES', 1),
 ('itv004563_retail_db', 'users', 'user_first_name', 'character varying', 30, None, 'NO', 2),
 ('itv004563_retail_db', 'users', 'user_last_name', 'character varying', 30, None, 'NO', 3),
 ('itv004563_retail_db', 'users', 'user_email_id', 'character varying', 50, None, 'NO', 4),
 ('itv004563_retail_db', 'users', 'user_email_validated', 'boolean', None, 'false', 'YES', 5),
 ('itv004563_retail_db', 'users', 'user_password', 'character varying', 200, None, 'YES', 6),
 ('itv004563_retail_db', 'users', 'user_role', 'character varying', 1, "'U'::character varying", 'NO', 7),
 ('itv004563_retail_db', 'users', 'is_active', 'boolean', None, 'false', 'YES', 8),
 ('itv004563_retail_db', 'users', 'created_dt', 'date', None, 'CURRENT_DATE', 'YES', 9),
 ('itv004563_retail_db', 'users', 'last_updated_ts', 'timestamp without time zone', None, 'CURRENT_TIMESTAMP', 'YES', 10)]

In [158]:
%sql COMMENT ON TABLE users IS 'This is where the user details are stored'

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
Done.

[]

In [160]:
%sql COMMENT ON COLUMN users.user_id IS 'Surrogate key'

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
Done.

[]

In [161]:
%sql COMMENT ON COLUMN users.user_first_name IS 'User First Name'

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
Done.

[]

In [163]:
%sql COMMENT ON COLUMN users.user_role IS 'U for user A for admin'

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
Done.

[]

In [166]:
%%sql
SELeCT * FROM information_schema.columns
WHERE table_name = 'users'
ORDER BY ordinal_position

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
10 rows affected.

[('itv004563_retail_db', 'public', 'users', 'user_id', 1, "nextval('users_user_id_seq'::regclass)", 'NO', 'integer', None, None, 32, 2, 0, None, None, None, None, None, None, None, None, None, None, None, None, 'itv004563_retail_db', 'pg_catalog', 'int4', None, None, None, None, '1', 'NO', 'NO', None, None, None, None, None, 'NO', 'NEVER', None, 'YES'),
 ('itv004563_retail_db', 'public', 'users', 'user_first_name', 2, None, 'NO', 'character varying', 30, 120, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, 'itv004563_retail_db', 'pg_catalog', 'varchar', None, None, None, None, '2', 'NO', 'NO', None, None, None, None, None, 'NO', 'NEVER', None, 'YES'),
 ('itv004563_retail_db', 'public', 'users', 'user_last_name', 3, None, 'NO', 'character varying', 30, 120, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, 'itv004563_retail_db', 'pg_catalog', 'varchar', None, None, None, None, '3', 'NO', 'NO', None, None, None, None, None, 'NO', 'NEVER', None, 'YES'),
 ('itv004563_retail_db', 'public', 'users', 'user_email_id', 4, None, 'NO', 'character varying', 50, 200, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, 'itv004563_retail_db', 'pg_catalog', 'varchar', None, None, None, None, '4', 'NO', 'NO', None, None, None, None, None, 'NO', 'NEVER', None, 'YES'),
 ('itv004563_retail_db', 'public', 'users', 'user_email_validated', 5, 'false', 'YES', 'boolean', None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, 'itv004563_retail_db', 'pg_catalog', 'bool', None, None, None, None, '5', 'NO', 'NO', None, None, None, None, None, 'NO', 'NEVER', None, 'YES'),
 ('itv004563_retail_db', 'public', 'users', 'user_password', 6, None, 'YES', 'character varying', 200, 800, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, 'itv004563_retail_db', 'pg_catalog', 'varchar', None, None, None, None, '6', 'NO', 'NO', None, None, None, None, None, 'NO', 'NEVER', None, 'YES'),
 ('itv004563_retail_db', 'public', 'users', 'user_role', 7, "'U'::character varying", 'NO', 'character varying', 1, 4, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, 'itv004563_retail_db', 'pg_catalog', 'varchar', None, None, None, None, '7', 'NO', 'NO', None, None, None, None, None, 'NO', 'NEVER', None, 'YES'),
 ('itv004563_retail_db', 'public', 'users', 'is_active', 8, 'false', 'YES', 'boolean', None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, 'itv004563_retail_db', 'pg_catalog', 'bool', None, None, None, None, '8', 'NO', 'NO', None, None, None, None, None, 'NO', 'NEVER', None, 'YES'),
 ('itv004563_retail_db', 'public', 'users', 'created_dt', 9, 'CURRENT_DATE', 'YES', 'date', None, None, None, None, None, 0, None, None, None, None, None, None, None, None, None, None, None, 'itv004563_retail_db', 'pg_catalog', 'date', None, None, None, None, '9', 'NO', 'NO', None, None, None, None, None, 'NO', 'NEVER', None, 'YES'),
 ('itv004563_retail_db', 'public', 'users', 'last_updated_ts', 10, 'CURRENT_TIMESTAMP', 'YES', 'timestamp without time zone', None, None, None, None, None, 6, None, None, None, None, None, None, None, None, None, None, None, 'itv004563_retail_db', 'pg_catalog', 'timestamp', None, None, None, None, '10', 'NO', 'NO', None, None, None, None, None, 'NO', 'NEVER', None, 'YES')]

## Adding or Modifying Columns

Changing he data type of user_id to SERIAL

In [172]:
%sql CREATE SEQUENCE users_user_id_seq

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
Done.

[]

In [175]:
%sql ALTER TABLE users ALTER COLUMN user_id SET DEFAULT nextval('users_user_id_seq')

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
Done.

[]

In [176]:
%%sql 

SELECT table_catalog, 
    table_name,
    column_name,
    data_type,
    character_maximum_length,
    column_default,
    is_nullable,
    ordinal_position
FROM information_schema.columns 
WHERE table_name = 'users'
ORDER BY ordinal_position

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
10 rows affected.

[('itv004563_retail_db', 'users', 'user_id', 'integer', None, "nextval('users_user_id_seq'::regclass)", 'YES', 1),
 ('itv004563_retail_db', 'users', 'user_first_name', 'character varying', 30, None, 'NO', 2),
 ('itv004563_retail_db', 'users', 'user_last_name', 'character varying', 30, None, 'NO', 3),
 ('itv004563_retail_db', 'users', 'user_email_id', 'character varying', 50, None, 'NO', 4),
 ('itv004563_retail_db', 'users', 'user_email_validated', 'boolean', None, 'false', 'YES', 5),
 ('itv004563_retail_db', 'users', 'user_password', 'character varying', 200, None, 'YES', 6),
 ('itv004563_retail_db', 'users', 'user_role', 'character varying', 1, "'U'::character varying", 'NO', 7),
 ('itv004563_retail_db', 'users', 'is_active', 'boolean', None, 'false', 'YES', 8),
 ('itv004563_retail_db', 'users', 'created_dt', 'date', None, 'CURRENT_DATE', 'YES', 9),
 ('itv004563_retail_db', 'users', 'last_updated_ts', 'timestamp without time zone', None, 'CURRENT_TIMESTAMP', 'YES', 10)]

In [178]:
%%sql

ALTER TABLE users
    ALTER COLUMN user_role SET DATA TYPE CHAR(1),
    ALTER COLUMN user_role SET DEFAULT 'U'

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
Done.

[]

In [179]:
%%sql 

SELECT table_catalog, 
    table_name,
    column_name,
    data_type,
    character_maximum_length,
    column_default,
    is_nullable,
    ordinal_position
FROM information_schema.columns 
WHERE table_name = 'users'
ORDER BY ordinal_position

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
10 rows affected.

[('itv004563_retail_db', 'users', 'user_id', 'integer', None, "nextval('users_user_id_seq'::regclass)", 'YES', 1),
 ('itv004563_retail_db', 'users', 'user_first_name', 'character varying', 30, None, 'NO', 2),
 ('itv004563_retail_db', 'users', 'user_last_name', 'character varying', 30, None, 'NO', 3),
 ('itv004563_retail_db', 'users', 'user_email_id', 'character varying', 50, None, 'NO', 4),
 ('itv004563_retail_db', 'users', 'user_email_validated', 'boolean', None, 'false', 'YES', 5),
 ('itv004563_retail_db', 'users', 'user_password', 'character varying', 200, None, 'YES', 6),
 ('itv004563_retail_db', 'users', 'user_role', 'character', 1, "'U'::bpchar", 'NO', 7),
 ('itv004563_retail_db', 'users', 'is_active', 'boolean', None, 'false', 'YES', 8),
 ('itv004563_retail_db', 'users', 'created_dt', 'date', None, 'CURRENT_DATE', 'YES', 9),
 ('itv004563_retail_db', 'users', 'last_updated_ts', 'timestamp without time zone', None, 'CURRENT_TIMESTAMP', 'YES', 10)]

Setting the user email validated default value to false

In [180]:
%%sql

ALTER TABLE users
    ALTER COLUMN user_email_validated SET DEFAULT TRUE,
    ALTER COLUMN is_active SET DEFAULT TRUE

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
Done.

[]

In [181]:
%%sql 

SELECT table_catalog, 
    table_name,
    column_name,
    data_type,
    character_maximum_length,
    column_default,
    is_nullable,
    ordinal_position
FROM information_schema.columns 
WHERE table_name = 'users'
ORDER BY ordinal_position

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
10 rows affected.

[('itv004563_retail_db', 'users', 'user_id', 'integer', None, "nextval('users_user_id_seq'::regclass)", 'YES', 1),
 ('itv004563_retail_db', 'users', 'user_first_name', 'character varying', 30, None, 'NO', 2),
 ('itv004563_retail_db', 'users', 'user_last_name', 'character varying', 30, None, 'NO', 3),
 ('itv004563_retail_db', 'users', 'user_email_id', 'character varying', 50, None, 'NO', 4),
 ('itv004563_retail_db', 'users', 'user_email_validated', 'boolean', None, 'true', 'YES', 5),
 ('itv004563_retail_db', 'users', 'user_password', 'character varying', 200, None, 'YES', 6),
 ('itv004563_retail_db', 'users', 'user_role', 'character', 1, "'U'::bpchar", 'NO', 7),
 ('itv004563_retail_db', 'users', 'is_active', 'boolean', None, 'true', 'YES', 8),
 ('itv004563_retail_db', 'users', 'created_dt', 'date', None, 'CURRENT_DATE', 'YES', 9),
 ('itv004563_retail_db', 'users', 'last_updated_ts', 'timestamp without time zone', None, 'CURRENT_TIMESTAMP', 'YES', 10)]

We can alter multiple columns at once for a particular table

In [182]:
%%sql

ALTER TABLE users
    ALTER COLUMN user_id SET DEFAULT next_val ('users_user_id_seq'),
    ALTER COLUMN user_email_validated SET DEFAULT FALSE,
    ALTER COLUMN is_active SET DEFAULT FALSE,
    ALTER COLUMN user_role SET DATA TYPE CHAR(2),
    ADD COLUMN last_updated_ts TIMESTAMP DEFAULT CURRENT_TIMESTAMP

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
(psycopg2.errors.DuplicateColumn) column "last_updated_ts" of relation "users" already exists

[SQL: ALTER TABLE users ALTER COLUMN user_id SET DEFAULT next_val ('users_user_id_seq'),
    ALTER COLUMN user_email_validated SET DEFAULT FALSE,
    ALTER COLUMN is_active SET DEFAULT FALSE,
    ALTER COLUMN user_role SET DATA TYPE CHAR(2),
    ADD COLUMN last_updated_ts TIMESTAMP DEFAULT CURRENT_TIMESTAMP]
(Background on this error at: http://sqlalche.me/e/14/f405)

In [184]:
%%sql

SELECT * FROM information_schema.sequences
WHERE sequence_name ~ 'users'

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
1 rows affected.

[('itv004563_retail_db', 'public', 'users_user_id_seq', 'bigint', 64, 2, 0, '1', '1', '9223372036854775807', '1', 'NO')]

## Managing Constraints

In [185]:
%%sql
ALTER TABLE users ADD PRIMARY KEY (user_id)

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
Done.

[]

In [189]:
%%sql

SELECT table_catalog,
    table_name, 
    constraint_type, 
    constraint_name
FROM information_schema.table_constraints
WHERE table_name = 'users'

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
6 rows affected.

[('itv004563_retail_db', 'users', 'PRIMARY KEY', 'users_pkey'),
 ('itv004563_retail_db', 'users', 'CHECK', '2200_254925_1_not_null'),
 ('itv004563_retail_db', 'users', 'CHECK', '2200_254925_2_not_null'),
 ('itv004563_retail_db', 'users', 'CHECK', '2200_254925_3_not_null'),
 ('itv004563_retail_db', 'users', 'CHECK', '2200_254925_4_not_null'),
 ('itv004563_retail_db', 'users', 'CHECK', '2200_254925_7_not_null')]

Adding constraints to the user_id

In [197]:
%sql ALTER TABLE users ADD PRIMARY KEY (user_id)

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
(psycopg2.errors.InvalidTableDefinition) multiple primary keys for table "users" are not allowed

[SQL: ALTER TABLE users ADD PRIMARY KEY (user_id)]
(Background on this error at: http://sqlalche.me/e/14/f405)

In [206]:
%sql ALTER TABLE users DROP CONSTRAINT users_pkey

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
Done.

[]

In [200]:
%%sql

SELECT table_catalog,
    table_name, 
    constraint_type, 
    constraint_name
FROM information_schema.table_constraints
WHERE table_name = 'users'

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
5 rows affected.

[('itv004563_retail_db', 'users', 'CHECK', '2200_254925_1_not_null'),
 ('itv004563_retail_db', 'users', 'CHECK', '2200_254925_2_not_null'),
 ('itv004563_retail_db', 'users', 'CHECK', '2200_254925_3_not_null'),
 ('itv004563_retail_db', 'users', 'CHECK', '2200_254925_4_not_null'),
 ('itv004563_retail_db', 'users', 'CHECK', '2200_254925_7_not_null')]

In [207]:
%sql ALTER TABLE users ADD CONSTRAINT users_pk PRIMARY KEY (user_id)

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
Done.

[]

In [208]:
%%sql

SELECT table_catalog,
    table_name, 
    constraint_type, 
    constraint_name
FROM information_schema.table_constraints
WHERE table_name = 'users'

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
6 rows affected.

[('itv004563_retail_db', 'users', 'PRIMARY KEY', 'users_pk'),
 ('itv004563_retail_db', 'users', 'CHECK', '2200_254925_1_not_null'),
 ('itv004563_retail_db', 'users', 'CHECK', '2200_254925_2_not_null'),
 ('itv004563_retail_db', 'users', 'CHECK', '2200_254925_3_not_null'),
 ('itv004563_retail_db', 'users', 'CHECK', '2200_254925_4_not_null'),
 ('itv004563_retail_db', 'users', 'CHECK', '2200_254925_7_not_null')]

In [209]:
%sql ALTER TABLE users ADD UNIQUE (user_email_id)

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
Done.

[]

In [210]:
%%sql 

SELECT table_catalog,
    table_name,
    constraint_type,
    constraint_name 
FROM information_schema.table_constraints 
WHERE table_name = 'users'

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
7 rows affected.

[('itv004563_retail_db', 'users', 'PRIMARY KEY', 'users_pk'),
 ('itv004563_retail_db', 'users', 'UNIQUE', 'users_user_email_id_key'),
 ('itv004563_retail_db', 'users', 'CHECK', '2200_254925_1_not_null'),
 ('itv004563_retail_db', 'users', 'CHECK', '2200_254925_2_not_null'),
 ('itv004563_retail_db', 'users', 'CHECK', '2200_254925_3_not_null'),
 ('itv004563_retail_db', 'users', 'CHECK', '2200_254925_4_not_null'),
 ('itv004563_retail_db', 'users', 'CHECK', '2200_254925_7_not_null')]

In [212]:
%%sql

ALTER TABLE users
    ADD CHECK (user_role IN ('U', 'A'))

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
Done.

[]

In [213]:
%%sql 

SELECT table_catalog,
    table_name,
    constraint_type,
    constraint_name 
FROM information_schema.table_constraints 
WHERE table_name = 'users'

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
8 rows affected.

[('itv004563_retail_db', 'users', 'PRIMARY KEY', 'users_pk'),
 ('itv004563_retail_db', 'users', 'UNIQUE', 'users_user_email_id_key'),
 ('itv004563_retail_db', 'users', 'CHECK', 'users_user_role_check'),
 ('itv004563_retail_db', 'users', 'CHECK', '2200_254925_1_not_null'),
 ('itv004563_retail_db', 'users', 'CHECK', '2200_254925_2_not_null'),
 ('itv004563_retail_db', 'users', 'CHECK', '2200_254925_3_not_null'),
 ('itv004563_retail_db', 'users', 'CHECK', '2200_254925_4_not_null'),
 ('itv004563_retail_db', 'users', 'CHECK', '2200_254925_7_not_null')]

In [214]:
%%sql

CREATE TABLE user_logins (
    user_login_id SERIAL PRIMARY KEY,
    user_id INT,
    user_login_ts TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    user_ip_addr VARCHAR(20)
)

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
Done.

[]

In [215]:
%%sql 

SELECT table_catalog,
    table_name,
    constraint_type,
    constraint_name 
FROM information_schema.table_constraints 
WHERE table_name = 'user_logins'

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
2 rows affected.

[('itv004563_retail_db', 'user_logins', 'PRIMARY KEY', 'user_logins_pkey'),
 ('itv004563_retail_db', 'user_logins', 'CHECK', '2200_254962_1_not_null')]

In [218]:
%sql DROP TABLE users CASCADE

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
(psycopg2.errors.UndefinedTable) table "users" does not exist

[SQL: DROP TABLE users CASCADE]
(Background on this error at: http://sqlalche.me/e/14/f405)

In [219]:
%%sql 

SELECT table_catalog,
    table_name,
    constraint_type,
    constraint_name 
FROM information_schema.table_constraints 
WHERE table_name = 'user_logins'

 * postgresql://itv004563_retail_user:***@pg.itversity.com:5433/itv004563_retail_db
2 rows affected.

[('itv004563_retail_db', 'user_logins', 'PRIMARY KEY', 'user_logins_pkey'),
 ('itv004563_retail_db', 'user_logins', 'CHECK', '2200_254962_1_not_null')]

## Indexes on Tables